'''
Снова не успел

Дан режим работы магазина:

Понедельник    9:00 - 21:00
Вторник        9:00 - 21:00
Среда          9:00 - 21:00
Четверг        9:00 - 21:00
Пятница        9:00 - 21:00
Суббота        10:00 - 18:00
Воскресенье    10:00 - 18:00

Напишите программу, которая принимает на вход текущие дату и время 
и определяет количество минут, оставшееся до закрытия магазина.

Формат входных данных
На вход программе подаются текущие дата и время в формате DD.MM.YYYY HH:MM.

Формат выходных данных
Программа должна вывести количество минут, которое осталось до закрытия магазина, 
или текст Магазин не работает, если он закрыт.

Примечание. Тестовые данные доступны по ссылке.
https://stepik.org/media/attachments/lesson/571244/tests_2506803.zip
'''
pass