'''
Удалить каждый третий символ
Дана строка. Удалите из нее все символы, чьи индексы делятся на 3.

Входные данные
Вводится строка.

Выходные данные
Выведите ответ на задачу.

Sample Input:
Python
Sample Output:
yton
'''
import sys  

sys.stdin = open(file='038.csv', mode='rt', encoding='utf-8', newline='')
arr = sys.stdin.read()
print(arr) # test

pass