'''
Проще, чем кажется 🌶️
Рассмотрим следующий текстовый фрагмент:

ball,color,purple
ball,size,4
ball,notes,it's round
cup,color,blue
cup,size,1
cup,notes,none

Каждая строка этого фрагмента содержит три значения через запятую: имя объекта, 
свойство этого объекта, значение свойства. Например, в первой строке указан объект ball, 
имеющий свойство color, значение которого равно purple. 
Также у объекта ball есть свойства size и notes, имеющие значения 4 и it's round соответственно. 
Помимо объекта ball имеется объект cup, имеющий те же свойства и в том же количестве. 
Дадим этим объектам общее название object и сгруппируем строки данного текстового 
фрагмента по первому столбцу:

object,color,size,notes
ball,purple,4,it's round
cup,blue,1,none

Мы получили запись в привычном CSV формате, в котором в первом столбце указывается имя объекта, 
а в последующих — значения соответствующих свойств этого объекта.

Реализуйте функцию condense_csv(), которая принимает два аргумента в следующем формате:

filename — название csv файла, например, data.csv; формат содержимого файла аналогичен 
формату текстового фрагмента, рассмотренного в условии задачи: каждая строка файла содержит 
три значения через запятую, а именно имя объекта, свойство этого объекта, значение свойства; 
все объекты имеют равные свойства и в равных количествах

id_name — общее название для объектов

Функция должна привести содержимое файла в привычный CSV формат, сгруппировав строки по первому 
столбцу и назвав первый столбец id_name. Полученный результат функция должна записать 
в файл condensed.csv.

Примечание 1. Например, если бы файл data.csv имел следующий вид:

01,Title,Ran So Hard the Sun Went Down
02,Title,Honky Tonk Heroes (Like Me)

то вызов функции condense_csv():

condense_csv('data.csv', id_name='ID')

должен был бы создать файл condensed.csv со следующим содержанием:

ID,Title
01,Ran So Hard the Sun Went Down
02,Honky Tonk Heroes (Like Me)

Примечание 2. Гарантируется, что в передаваемом в функцию csv файле разделителем является запятая, 
при этом кавычки не используются.

Примечание 3. При открытии файла используйте явное указание кодировки UTF-8.

Примечание 4. В тестирующую систему сдайте программу, содержащую только необходимую функцию condense_csv(), 
но не код, вызывающий ее.

Примечание 5. Тестовые данные доступны по ссылке.
https://stepik.org/media/attachments/lesson/518491/tests_3069917.zip
'''
import csv

def condense_csv(filename, id_name):
    with open(file=filename, mode='rt', encoding='utf-8', newline='') as file_opener,\
        open(file='condensed.csv', mode='wt', encoding='utf-8', newline='') as file_writener:

        csv_opener = tuple(csv.reader(file_opener, delimiter=',', quoting=csv.QUOTE_NONE))
        # print(csv_opener) # test

        arr = [{id_name: v, k1: v1} for v, k1, v1 in csv_opener]
        # print(arr) # test

        id_one = list(arr[0].values())[0]
        # print(id_one) # test

        fieldnames = [id_name]
        for d in arr:
            if d[id_name] == id_one:
                fieldnames += [list(d.keys())[1]]
        # print(fieldnames) # test

        arr_writener = list()
        buff_writener = list()
        i = 1
        fieldnames_len = len(fieldnames) - 1
        # print(f'fieldnames_len = {fieldnames_len}') # test

        for line_dict in arr:
            # print(line_dict) # test
            # print(f'i = {i}') # test
            if fieldnames_len >= i:
                if 1 == i:
                    buff_writener.append(list(line_dict.values())[0])
                buff_writener.append(list(line_dict.values())[1])
                if fieldnames_len == i:
                    arr_writener.append(buff_writener.copy())
                    buff_writener.clear()
                    # print(arr_writener) # test
                    i = 1
                    continue
            i += 1
        # print(arr_writener) # test

        csv_writener = csv.writer(file_writener, delimiter=',', quoting=csv.QUOTE_NONE)
        csv_writener.writerow(fieldnames)
        csv_writener.writerows(arr_writener)

if __name__ == '__main__':
    condense_csv('020-data.csv', id_name='ID')