'''
Последняя цифра
Дано натуральное число. Выведите его последнюю цифру.

Входные данные
Вводится натуральное число.

Выходные данные
Выведите ответ на задачу.

Tests:

Sample Input:
176
Sample Output:
6
'''
print(input()[-1])