'''
Тестирующая система
В условии одной из задач на неком сайте написано: 
“Если данное четырехзначное число является симметричным, 
выведите 1, иначе выведите любое другое целое число”. 
Для проверки задачи используются заранее подготовленные 
примеры и правильные ответы на них.

Школьнику кажется, что он решил эту задачу, но тестирующая 
система почему-то не принимает его решение. Школьник думает, 
что это происходит оттого, что он выводит не то любое другое число, 
которое записано в правильных ответах.

Напишите программу, которая по ответу, записанному в тестирующей 
системе, и по ответу школьника определяет, верно ли школьник решил задачу.

Входные данные
Программа получает на вход два числа: ответ, записанный 
в тестирующей системе, и ответ школьника.

Выходные данные
Программа должна вывести YES, если школьник дал верный ответ, 
и NO в противном случае.

Sample Input 1:
11
-1
Sample Output 1:
YES

Sample Input 2:
1111
1
Sample Output 2:
NO
'''
print