'''
Билеты на метро - 2
Билет на одну поездку в метро стоит 15 рублей, 
билет на 5 поездок стоит 70 рублей, билет на 10 поездок стоит 125 рублей, 
билет на 20 поездок стоит 230 рублей, билет на 60 поездок стоит 440 рублей. 
Пассажир планирует совершить n поездок. Определите, сколько билетов каждого 
вида он должен приобрести, чтобы суммарное количество оплаченных поездок 
было не меньше n, а общая стоимость приобретенных билетов – минимальна.

Входные данные
Дано одно число n - количество поездок.

Выходные данные
Выведите пять целых чисел, равные необходимому количеству билетов 
на 1, на 5, на 10, на 20, на 60 поездок. Если для какого-то данного 
n существует несколько способов приобретения билетов одинаковой стоимости, 
необходимо вывести ту комбинацию билетов, которая дает большее число поездок.

Sample Input:
1
Sample Output:
1 0 0 0 0
'''
pass