'''
Одномерный numpy массив
Создайте одномерный numpy массив чисел от 0 до 9 
и выведите его на экран. Не забудьте импортировать библиотеку.

Sample Input:

Sample Output:
[0 1 2 3 4 5 6 7 8 9]
'''
import numpy as np

print(np.arange(10))