'''
Объединение и повторение

На вход поступают две строки, содержащие целые числа. Необходимо создать 
на их основе два массива numpy, объединить их, а затем повторить полученный 
массив три раза. Выведите на экран итоговый массив.

Sample Input:
4 4 16 27 42 49 32 1 5 26 34 37 45 12 2 4 20 14 38 50
21 36 23 30 51 24 10 26 51 26 45 26 11 30 29 49 36 9 13 27
Sample Output:
[ 4  4  4  4  4  4 16 16 16 27 27 27 42 42 42 49 49 49 32 32 32  1  1  1
  5  5  5 26 26 26 34 34 34 37 37 37 45 45 45 12 12 12  2  2  2  4  4  4
 20 20 20 14 14 14 38 38 38 50 50 50 21 21 21 36 36 36 23 23 23 30 30 30
 51 51 51 24 24 24 10 10 10 26 26 26 51 51 51 26 26 26 45 45 45 26 26 26
 11 11 11 30 30 30 29 29 29 49 49 49 36 36 36  9  9  9 13 13 13 27 27 27]
'''
import numpy as np

if __name__ == '__main__':
    arr1 = np.array(object=input().split(), dtype=int)
    arr2 = np.array(object=input().split(), dtype=int)
    arr3 = np.concatenate((arr1, arr2)).repeat(3)
    print(arr3)