'''
Append

На вход поступают две строки. В первой содержатся целые числа, разделенные пробелом, 
во второй одно целое число n. На основе первой строки создать numpy массив a. 
Далее создать numpy массив b, в котором первым элементом является число n, 
далее следуют числа массива a. Массивы a и b вывести на экран, каждый с новой строки.

Sample Input:
2 24 17 23 29 23 18 26
-1
Sample Output:
[ 2 24 17 23 29 23 18 26]
[-1  2 24 17 23 29 23 18 26]
'''
import numpy as np

if __name__ == '__main__':
    pass