'''
slice-7

На вход поступает две строки, содержащие одинаковое количество целых чисел, 
разделенных пробелом. На их основе создать список numpy, состоящий из элементов, 
которые находятся на четных позициях первого списка, затем следуют элементы, 
стоящие на нечетных позициях второго списка. Если длина списков нечетная, 
то последний элемент не учитывается. Полученный список вывести на экран.

Sample Input:
5 21 7 29 25 25 13 6 30 23
23 63 34 5 66 81 81 31 3 83
Sample Output:
[ 5  7 25 13 30 63  5 81 31 83]
'''
import numpy as np

if __name__ == '__main__':
    pass