'''
Статистика

Ваша команда исследователей работает над проектом, который требует 
анализа большого количества данных. Один из массивов данных, называемый data, 
содержит результаты эксперимента для каждого участника. Вам нужно вывести 
срез массива, который содержит все результаты, кроме первых 5 и тех которые 
стоят на местах индексы которых кратны 3.

Sample Input:
18 16 19 20 26 29 20 9 6 16 25 15 6 25 23 23 29 22 17 21 19 28 18 17 18 21 28 28 24 5 10 11 8 8 9 14 28 13 31 18 29 20 32 25 13 5 7 11 31 31 11 29 7 6 18 30 25 22 15 24 24 16 18 6 5 15 25 32 13 19 11 13 30 23 6 9 15 7 8 9 29 23 29 22 5 31 11 15 22 17 12 16 14 28 7 29 24 15 10 25 21 5 22 24 15 6 17 12 11 24 30 14 23 12 21 8 20 17 32 26
Sample Output:
[29  9  6 25 15 25 23 29 22 21 19 18 17 21 28 24  5 11  8  9 14 13 31 29
 20 25 13  7 11 31 11  7  6 30 25 15 24 16 18  5 15 32 13 11 13 23  6 15
  7  9 29 29 22 31 11 22 17 16 14  7 29 15 10 21  5 24 15 17 12 24 30 23
 12  8 20 32 26]
'''
import numpy as np

if __name__ == '__main__':
    data = np.fromstring(string=input(), dtype=int, sep=' ')
    data_res = np.zeros(0, dtype=int)
    for i, el in enumerate(data):
        if i in range(5): continue
        # if 0!=i%3: data_res = np.append(arr=data_res, values=el)
        if i%3: data_res = np.append(arr=data_res, values=el)
    print(data_res)