'''
Путешествие по пустыне

Вы отправляетесь в путешествие по пустыне, но у вас есть только один компас, 
который показывает направление на север. Вы решили использовать массив directions, 
который представляет собой последовательность чисел, где 0 означает движение 
на север, 1 - на восток, 2 - на юг и 3 - на запад. Вам нужно создать новый 
массив north_directions, который будет содержать только те значения 
массива directions, которые означают движение на север. Вам нужно вывести 
каждое второе из значений нового массива.

Sample Input:
1 3 2 2 1 3 2 3 2 2 0 3 2 1 2 2 0 0 0 1 3 3 0 3
Sample Output:
[0 0]
'''
import numpy as np

if __name__ == '__main__':
    pass