'''
Золотая рыбка

В глубинах океана живет золотая рыбка, которая обладает волшебной способностью умножать 
и делить числа. Однажды, капитан корабля потерял свои карты, на которых были указаны 
координаты пути к сокровищам. Он обратился за помощью к золотой рыбке, и она согласилась 
помочь, но только если капитан даст ей массив чисел. Золотая рыбка умножит каждый 
элемент массива на 3 и разделит на 2, затем к результату каждой операции добавит 10. 
После этого она вернет массив обратно капитану, а он должен будет найти индексы элементов, 
которые меньше среднего значения всех элементов и вывести их на экран, вместе с итоговым 
массивом каждый с новой строки.

На вход поступает строка чисел, разделенных пробелом, на основе которой нужно создать 
массив numpy  и произвести с ним манипулации в соответсвии с условием задачи.

Sample Input:
0 38 93 15 65 4 87 99 17 51 84 13 78 45 85 14 10 22 23 68 88 28 65
Sample Output:
[0, 1, 3, 5, 8, 11, 13, 15, 16, 17, 18, 21]
[ 10.   67.  149.5  32.5 107.5  16.  140.5 158.5  35.5  86.5 136.   29.5
 127.   77.5 137.5  31.   25.   43.   44.5 112.  142.   52.  107.5]
'''
import numpy as np

pass

if __name__ == '__main__':
    pass