'''
Сравнение показателей здоровья

Вы проводите медицинские исследования и хотите определить, какой из двух лекарственных 
препаратов более эффективен для лечения конкретного заболевания. Для этого вам поступают 
два одномерных массива а, b с показателями здоровья пациентов, которые получали каждый 
из препаратов. Вам необходимо сделать вывод о том какой препарат более эффективен а или b.

Более эффективным препаратом считать тот для которого больше количество показателей 
здоровья превышающих аналогичные показатели для другого лекарства. Например если 
в первом массиве значения [ 1 2 1] а во втором [10 1 0], то более эффективным 
считается первый препарат, так как для него два показателя здоровья выше, чем у 
второго препарата. В качестве ответа вывести а если эффективнее первый препарат, 
в противном случае b. Гарантируется, что какой-то один из препаратов эффективнее.

Sample Input:
1 2 3 4
2 3 4 1
Sample Output:
b
'''
import numpy as np

pass

if __name__ == '__main__':
    pass