'''
Охота на трофеи

На острове сокровищ произошло странное событие. Капитан Флинт прибыл на остров 
и встретился с Джимом Хокинсом. Они вытащили из своих сумок по кучке золотых монет. 
Флинт заинтересовался их количеством, а Хокинс - их стоимостью. Чтобы узнать, 
кто из них богаче, Хокинс предложил посчитать, сколько монет Флинта имеют большую 
стоимость, чем каждая монета у Хокинса. Теперь им нужна ваша помощь в написании 
функции count_greater(arr1, arr2), которая принимает на вход два одномерных массива, 
содержащих только числа (количество золотых монет), и возвращает массив, содержащий 
элементы первого массива, которые больше каждого элемента второго массива.

Sample Input:
1 2 3 4 5 6
1 2 3 4 4 4 4

Sample Output:
[5 6]
'''
import numpy as np

pass

if __name__ == '__main__':
    pass