'''
Замените все отрицательные значения

На вход подается строка действительных чисел, разделённых пробелом. 
Замените все отрицательные значения в массиве на среднее значение положительных элементов. 
Итоговый массив выведите в строчку через пробел. Результат округляйте до трех знаков после запятой.

Sample Input 1:
1 2 3 4 5 6
Sample Output 1:
1.0 2.0 3.0 4.0 5.0 6.0

Sample Input 2:
2 4 -1 -4 
Sample Output 2:
2.0 4.0 3.0 3.0

Sample Input 3:
2 4 -1 -4 0
Sample Output 3:
2.0 4.0 3.0 3.0 0.0

Sample Input 4:
-1.971 -3.085 0.208 -1.748 5.672 -2.406 -4.231 1.971 1.613 -4.5 5.388 -4.453 3.397 -5.264 4.478 -0.159 0.046 2.192 5.592 -3.171 0.497 4.641 -2.839 4.979 -4.229 2.884 -2.317 1.922 -2.962 -1.407 -0.781 -5.156 1.049 -1.411 4.626 -5.307 -2.898 -0.655 3.823 -3.066 -2.514 4.931 -3.628 5.251 1.525 3.073 -1.2 1.095 3.553 4.965 2.493 -4.643 1.122 -5.645 0.257 0.237 -0.05 -1.822 -5.293 5.572 -2.397 0.375 4.378 -0.89 4.806 -5.51 -1.032 -0.996 -0.637 -3.245 -0.887 -5.836 -1.215 2.823 -2.794 -5.981 1.686 5.515 -4.887 4.066 -0.553 -1.608 2.557 -2.878 4.463 -1.465 5.872 5.642 0.103 2.895 1.854 -5.164 -1.885 5.795 -2.951 -2.834 -0.807 -3.584 -2.017 1.087
Sample Output 4:
3.108 3.108 0.208 3.108 5.672 3.108 3.108 1.971 1.613 3.108 5.388 3.108 3.397 3.108 4.478 3.108 0.046 2.192 5.592 3.108 0.497 4.641 3.108 4.979 3.108 2.884 3.108 1.922 3.108 3.108 3.108 3.108 1.049 3.108 4.626 3.108 3.108 3.108 3.823 3.108 3.108 4.931 3.108 5.251 1.525 3.073 3.108 1.095 3.553 4.965 2.493 3.108 1.122 3.108 0.257 0.237 3.108 3.108 3.108 5.572 3.108 0.375 4.378 3.108 4.806 3.108 3.108 3.108 3.108 3.108 3.108 3.108 3.108 2.823 3.108 3.108 1.686 5.515 3.108 4.066 3.108 3.108 2.557 3.108 4.463 3.108 5.872 5.642 0.103 2.895 1.854 3.108 3.108 5.795 3.108 3.108 3.108 3.108 3.108 1.087
'''
import numpy as np
from sys import stdin
stdin = open(file='130.csv', mode='rt', encoding='utf-8', newline='')

if __name__ == '__main__':
#     arr = np.fromstring(
#         string=stdin.read(),
#         # dtype=int,
#         dtype=float,
#         sep = ' '
#     )
#     print(arr) # test #
#     print(type(arr)) # test #

    # arr1, arr2, arr3, *_ = (np.fromstring(string=i, dtype=int, sep=' ') for i in stdin)
    # print(arr1, arr2, arr3, sep='\n')

    arr1, *_ = (np.fromstring(string=i, dtype=int, sep=' ') for i in stdin)
    print(arr1)