'''
Итератор PowerOf
Реализуйте класс PowerOf, порождающий итераторы, конструктор которого 
принимает один аргумент:

number — ненулевое число

Итератор класса PowerOf должен генерировать бесконечную последовательность 
целых неотрицательных степеней числа number в порядке возрастания, начиная с нулевой степени.

Примечание 1. В тестирующую систему сдайте программу, содержащую только 
необходимый класс PowerOf.

Примечание 2. Тестовые данные доступны по ссылкам:

Архив с тестами
https://stepik.org/media/attachments/lesson/669733/tests_2771338.zip
GitHub
https://github.com/python-generation/Professional/tree/main/Module_10/Module_10.4/Module_10.4.11

Sample Input:
power_of_two = PowerOf(2)
print(next(power_of_two))
print(next(power_of_two))
print(next(power_of_two))
print(next(power_of_two))
Sample Output:
1
2
4
8
'''
pass

if __name__ == '__main__':
    pass