# Особенности словарей
# Ключи должны быть уникальными
print('####################')
info = {'name': 'Ruslan',
        'age': 28,
        'name': 'Timur'}
print(info['name'])

# Ключи должны быть неизменяемым типом данных
print('####################')
my_dict = {198: 'beegeek', 'name': 'Bob', True: 'a', (2, 2): 25}
print(my_dict)
# TypeError: unhashable type: 'list'
# my_dict = {[2, 2]: 25, {1, 2}: 'python', 'name': 'Bob'}

#Значения могут относиться к любому типу данных, их тип данных произволен
print('####################')
# значения – изменяемый тип данных 
my_dict1 = {'a': [1, 2, 3], 'b': {1, 2, 3}}
print(my_dict)
# значения повторяются
my_dict2 = {'a': [1, 2], 'b': [1, 2], 'c': [1, 2]}
print(my_dict2)