'''
Наилучший показатель
Вам доступен архив workbook.zip, содержащий различные папки и файлы. 
Напишите программу, которая выводит название файла из этого архива, 
который имеет наилучший показатель степени сжатия.

Примечание 1. Если файл находится в папке, вывести следует только название без пути.

Примечание 2. Гарантируется, что в исходном архиве только один файл 
имеет наилучший показатель степени сжатия.

Примечание 3. Степень сжатия файла характеризуется коэффициентом K, 
определяемым как отношение объема сжатого файла V_c к объему исходного файла V_o, 
выраженным в процентах:

K = (V_c / V_o) * 100%

Примечание 4. Указанный архив доступен по ссылке. Ответ на задачу доступен по ссылке.
https://stepik.org/media/attachments/lesson/547172/workbook.zip
https://stepik.org/media/attachments/lesson/547172/clue_coef.txt
'''
from zipfile import ZipFile

pass