print('------------------')

age = 29                # возраст человека

assert age > 0, 'Возраст должен быть положительным числом'

print('------------------')

# age = -29                # возраст человека

# assert age > 0, 'Возраст должен быть положительным числом'

print('------------------')

# num1 = 20
# num2 = 0

# assert num2 != 0, 'Делитель равен нулю.'
# # assert (num2 != 0, 'Делитель равен нулю.')

# print('Частное равно:', num1 / num2)

print('------------------')

# assert(2 + 2 == 5, "Houston we've got a problem")

print('------------------')