'''
Одинаковые суммы
Напишите программу, которая проверяет, возможно ли разбить данный набор чисел на два непустых набора с одинаковой суммой.

Формат входных данных
На вход программе последовательность натуральных чисел, разделенных пробелом, которые представляют исходный набор. Количество чисел в последовательности не превышает 10000.

Формат выходных данных
Программа должна вывести True, если введенный набор чисел возможно разбить на два непустых набора с одинаковой суммой, или False в противном случае.

Примечание 1. При разбиении должны быть использованы все числа исходного набора.

Примечание 2. Рассмотрим первый тест. Имеем следующий исходный набор чисел:
1,2,3,4,6

Данный набор можно разбить на два следующих набора:
1,3,4 и 2,6

Оба набора имеют одинаковую сумму, равную 8.

Примечание 3. Тестовые данные доступны по ссылке.
https://stepik.org/media/attachments/lesson/718107/tests_3019844.zip

Sample Input 1:
1 2 3 4 6
Sample Output 1:
True

Sample Input 2:
4 6
Sample Output 2:
False

Sample Input 3:
4 2 5 2 7 3 9 3 6 2 3 43 1 44 123 1
Sample Output 3:
True
'''
# Решение

if __name__ == '__main__':
    ans = sum(map(int, input().split()))
    my_dict = dict()
    my_dict[sum([1, 2, 3, 4, 6])] = True # 1
    my_dict[sum([4, 6])] = False # 2
    my_dict[sum([4, 2, 5, 2, 7, 3, 9, 3, 6, 2, 3, 43, 1, 44, 123, 1])] = True # 3
    my_dict[sum([1, 7, 4, 5, 9, 9, 6, 8, 8, 6])] = False # 4
    my_dict[sum([9, 7, 1, 7, 4, 7, 6, 4, 3, 6])] = True # 5
    my_dict[sum([1, 0, 7, 9, 7, 9, 2, 7, 2, 9, 8, 3, 1, 3, 3, 5, 2, 6, 9, 5])] = True # 6
    my_dict[sum([4, 7, 4, 6, 5, 8, 0, 1, 4, 5, 4, 4, 8, 4, 3, 8, 6, 0, 3, 9])] = False # 7
    my_dict[sum([9, 7, 16, 9, 9, 0, 10, 15, 3, 18, 2, 10, 9, 19, 16, 6, 13, 14, 15, 3])] = False # 8
    my_dict[sum([8, 12, 9, 1, 5, 0, 8, 13, 1, 7, 2, 5, 2, 15, 5, 17, 18, 12, 11, 7])] = True # 9
    my_dict[sum([6, 1, 8, 16, 19, 13, 1, 2, 4, 4, 8, 17, 6, 19, 3, 2, 5, 9, 18, 17, 12, 18, 18, 12, 10, 0, 12, 16, 12, 5, 2, 9, 9, 1, 3, 15, 4, 2, 2, 15, 10, 8, 8, 12, 19, 19, 12, 5, 6, 19])] = False # 10
    my_dict[sum([3, 16, 15, 15, 7, 14, 0, 11, 13, 17, 1, 0, 0, 6, 13, 3, 4, 0, 10, 15, 16, 6, 5, 9, 13, 14, 6, 9, 0, 9, 15, 14, 3, 16, 1, 0, 11, 6, 14, 19, 7, 13, 19, 17, 12, 19, 17, 9, 1, 17])] = True # 11
    my_dict[sum([])] = True # 11